
   {
     "recettes": [ 
      {
        "recette_id": "1",
        "recette_nom": "Smoothie au gigembre et légumes",
        "recette_description": "Un smoothie exotique, mélange délicat de douceur et de force exotique.",
        "recette_parts": "2",
        "recette_image": "https://i.ibb.co/Rb6XDrq/Smoothie.png",
        "recette_nutrition": "Calories : 187kcal \r\nLipides : 0.2g (0g S.Fat) \r\nGlucides : 42.5g \r\nProtéines : 5.4g \r\nSucre : 8.3g \r\nSodium : 360mg",
        "recette_instructions": "Placez tous les ingrédients, à l'exception de la garniture, dans un mixeur à haute puissance. Commencez à basse vitesse, puis augmentez la vitesse à haute vitesse. Mixez jusqu'à obtenir un mélange homogène.\r\n",
        "recette_ingredients": "2 petites carottes pelées (chacune)\r\n1/4 c. à thé de gingembre frais râpé\r\n1 tasse de petits fleurons de brocoli\r\n2 oranges de taille moyenne, pelées\r\n2 tasses de chou frisé haché, sans les tiges, emballé sans serrer \r\n2 pommes vertes moyennes, évidées\r\n1 1/2 tasse d'eau filtrée\r\n1 tasse de glace OU 1/2 tasse d'eau filtrée\r\nSel marin - au goût\r\nGarniture : petits fleurons de brocoli",
        "categorie": "Smoothie"
      },
      {
        "recette_id": "2",
        "recette_nom": "Muffins protéinés au quinoa",
        "recette_description": "Laissez vous tenter par ces petites bombes protéinées, riches en fibres, idéale pour démarrer la journée !",
        "recette_parts": "6",
        "recette_image": "https://i.ibb.co/86dKLXG/quinoa.png",
        "recette_nutrition": "Calories : 152kcal \r\nLipides : 10.4g (1.4g S.Fat) \r\nGlucides : 13.4g \r\nProtéines : 5.2g \r\nSucre : 8.9g \r\nSodium : 178mg",
        "recette_instructions": "Rincez le quinoa et placez-le dans une petite casserole munie d'un couvercle. Couvrir avec ½ tasse d'eau et porter à ébullition à feu moyen-élevé. Couvrez et baissez le feu à faible intensité. Laissez cuire pendant 20 minutes, puis retirez du feu. Retirez le couvercle et laissez refroidir.\r\nPréchauffez le four à 450°F. Tapissez six moules à muffins de caissettes en papier.\r\nMélangez les graines de chia moulues avec ¼ de tasse plus 2 cuillères à soupe d'eau et mettez de côté.\r\nAjoutez la farine d'amande, la poudre de protéines et le sel dans un petit bol. Bien mélanger. Ajouter les dattes et mélanger pour les enrober. Mettre de côté.\r\nMettez l'huile de noix de coco dans un bol moyen. Si elle n'est pas encore liquide, la mettre au micro-ondes et la chauffer pendant 10 à 20 secondes ou jusqu'à ce qu'elle soit fondue. Retirer du micro-ondes et ajouter le sirop d'érable. Remuez bien. Une fois refroidi, ajoutez le mélange de graines de chia, l'extrait de vanille, la noix de coco, le mélange de farine d'amande, le quinoa cuit et les raisins secs. Mélangez bien.\r\nRépartissez la pâte dans les six moules à muffins et faites cuire de 12 à 15 minutes, jusqu'à ce qu'un cure-dent inséré au centre en ressorte propre.\r\n",
        "recette_ingredients": "½ cup quinoa\r\n2 tbsp ground chia seeds or chia seeds\r\n¼ cup almond flour\r\n3 tbsp vanilla protein powder\r\n½ tsp salt\r\n½ cup dates, chopped small \r\n2 tbsp coconut oil\r\n3 tbsp maple syrup \r\n1 tsp vanilla extract\r\n¼ cup unsweetened shredded coconut\r\n½ cup raisins\r\n",
        "categorie": "Breakfast"
      },
      {
        "recette_id": "3",
        "recette_nom": "Linguines au tomates séchées du soleil ",
        "recette_description": "un condensé d'Italie dans votre assiette, direction Rome !",
        "recette_parts": "4",
        "recette_image": "https://i.ibb.co/3YCJrW8/Linguine.png",
        "recette_nutrition": "Calories : 519kcal \r\nLipides : 11.2g (0.9g S.Fat) \r\nGlucides : 50g \r\nProtéines : 16.2g \r\nSucre : 5g \r\nSodium : 391mg",
        "recette_instructions": "Placez les tomates séchées au soleil dans un bol et couvrez-les avec l'eau. Laissez-les tremper pendant 10 minutes, ou jusqu'à ce qu'elles soient réhydratées et tendres. Égouttez-les et réservez l'eau de trempage.\r\nFaites chauffer l'huile d'olive dans une grande casserole à feu moyen. Ajouter l'oignon et l'ail et faire sauter jusqu'à ce que l'oignon soit translucide. Ajouter les tomates séchées au soleil et les tomates cerises et faire cuire, en remuant de temps en temps, pendant environ 8 minutes, jusqu'à ce qu'elles soient tendres. Incorporer le basilic, la sauce tomate, la pâte de tomate, 1½ tasse de l'eau de trempage réservée et le sirop d'érable. Remuez jusqu'à ce que le tout soit combiné.\r\nUtilisez un mélangeur à immersion pour mixer le mélange jusqu'à ce qu'il soit lisse (ou presque lisse), ou transférez-le dans un mélangeur et mixez-le jusqu'à ce qu'il soit lisse. Laissez mijoter pendant 10 minutes supplémentaires, en remuant de temps en temps. Si la sauce crépite trop, réduire le feu à moyen-doux. Ajouter le poivre.\r\nPendant que la sauce cuit, porter une grande casserole d'eau à ébullition. Ajouter les linguines et les faire cuire selon les instructions de l'emballage jusqu'à ce qu'elles soient al dente. Égoutter.\r\nVous pouvez soit ajouter les pâtes à la sauce, soit servir les pâtes avec la sauce à la cuillère. Dans les deux cas, garnir d'un peu de parmesan Pepita (si vous en utilisez), d'olives, de câpres et de persil (si vous en utilisez). Servir immédiatement. Les restes se conservent dans un contenant hermétique au réfrigérateur pendant 3 à 4 jours\r\n",
        "recette_ingredients": "4 onces de tomates séchées au soleil, hachées\r\n2 tasses d'eau chaude\r\n1 cuillère à café d'huile d'olive\r\n½ oignon jaune moyen, coupé en dés\r\n2 gousses d'ail, pelées\r\n2 tasses de tomates cerises coupées en deux\r\n½ tasse de basilic frais haché\r\nUne boîte de 15 onces de sauce tomate sans sel.\r\nUne boîte de 6 onces de pâte de tomates sans sel.\r\n2 cuillères à café de sirop d'érable\r\nPoivre noir au goût\r\n1 livre de linguine (sans gluten si nécessaire)\r\nParmesan, facultatif\r\n½ tasse d'olives vertes dénoyautées et tranchées\r\n2 cuillères à soupe de câpres, rincées et égouttées\r\nPersil ou basilic frais haché, facultatif\r\n",
        "categorie": "Plats"
      },
      {
        "recette_id": "4",
        "recette_nom": "Snack Thaïlandais au tofu et chili doux",
        "recette_description": "Ne vous fiez pas aux apparences, ce petit snack est une bombe énergétique !",
        "recette_parts": "6",
        "recette_image": "https://i.ibb.co/2grMHmC/ananas.png",
        "recette_nutrition": "Calories : 83kcal \r\nLipides : 2.3g (0.2g S.Fat) \r\nGlucides : 9.1g \r\nProtéines : 4.3g \r\nSucre : 4g \r\nSodium : 119mg\r\n",
        "recette_instructions": "Préparez la sauce en mélangeant la fécule de maïs et 1 cuillère à soupe d'eau jusqu'à ce qu'elle soit lisse et mettez-la de côté.Ajoutez le vinaigre de riz, ⅔ tasse d'eau, le sucre, le piment, l'ail, le tamari, le persil et le poivre de Cayenne dans un robot culinaire.\r\nMixez jusqu'à ce que le tout soit bien mélangé et que le piment soit très bien fragmenté.\r\nVerser le mélange dans une petite casserole et chauffer jusqu'à ébullition, en remuant jusqu'à ce que le sucre soit dissous. Baisser le feu et laisser cuire 5 minutes.\r\nAjouter le mélange de fécule de maïs et remuer de temps en temps pendant environ 5 minutes ou jusqu'à ce que le mélange soit un peu épaissi. Retirez du feu et laissez refroidir.Ajoutez les cubes de tofu à la sauce chili sucrée refroidie. Laissez mariner environ 30 minutes.Égouttez l'ananas et coupez les anneaux en quartiers d'environ 1 à 1¼ pouce.Placez une tranche d'ananas dans une assiette et centrez un cube de tofu mariné sur le dessus. Placez une autre tranche d'ananas sur le tofu et fixez-la avec un cure-dent.",
        "recette_ingredients": "1 cuillère à soupe de fécule de maïs\r\n½ tasse de vinaigre de riz\r\n½ tasse de sucre de coco\r\n1 piment, tel que jalapeño ou cayenne, haché fin \r\n2 gousses d'ail, finement hachées\r\n2 cuillères à café de tamari\r\n½ cuillère à café de persil haché\r\n¼ c. à thé de poivre de Cayenne\r\n8 onces de tofu extra-firm, égoutté et coupé en cubes de 1 pouce\r\n1 boîte de 8 onces d'ananas en tranches",
        "categorie": "Snack"
      },
      {
        "recette_id": "5",
        "recette_nom": "Salade d'avocat, pommes et pignons de pin",
        "recette_description": "Simple, diététique et rafraîchissante, parfaite pour une entrée d'été !",
        "recette_parts": "2",
        "recette_image": "https://i.ibb.co/YTz3Y1Y/Salade.png",
        "recette_nutrition": "Calories : 470kcal \r\nLipides : 32g \r\nGlucides : 44,1 g \r\nProtéines : 11.8g \r\nSucre : 22.2g \r\nSodium : 55mg\r\n",
        "recette_instructions": "Dans une tasse ou un petit bol, mélanger les ingrédients de la vinaigrette.\r\nDans un grand bol, mélanger les légumes verts, l'avocat, les fraises, les graines de grenade et les noix de pin. Ajouter la vinaigrette et mélanger jusqu'à ce que le tout soit bien enrobé. Répartir dans deux bols et servir immédiatement...\r\n",
        "recette_ingredients": "VINAIGRETTE AUX AGRUMES ET AU CHILI  \r\n¼ tasse de jus d'orange\r\n2 cuillères à soupe de vinaigre de champagne (ou de vinaigre de vin blanc)\r\n1 cuillère à soupe de sirop d'érable\r\n2 cuillères à café d'huile d'olive\r\n½ cuillère à café de poudre de chili\r\nSALADE  \r\n3 tasses de jeunes pousses mélangées et tassées\r\n1 avocat, dénoyauté, pelé et haché\r\n1 tasse de fraises coupées en dés\r\n½ tasse de graines de grenade\r\n¼ tasse de pignons de pin grillés\r\n",
        "categorie": "Spupe et salade"
      }
    ]
  }  
